app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" ORDER BY release_date ASC
---
	def index
		@movies = Movie.all

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
---
	def show
		#id = params[:id]
		@movie = Movie.find(params[:id])

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
---
	def edit
		@movie = Movie.find(params[:id])

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "movies" SET "release_date" = '2001-03-05 00:00:00.000000', "updated_at" = '2013-08-03 01:17:38.914246' WHERE "movies"."id" = 2
---
	def update
		@movie = Movie.find(params[:id])
		@movie.update_attributes!(params[:movie])